/*查找鞍点:一个二维数组中的鞍点，是该位置上的元素在该行上最大，在该列上最小。也可能没有鞍
1  2  3  4  5
2  4  6  8  10
3  6  9  12 15
4  8  12 16 20
鞍点是0行4列，鞍点值是5*/ 
#include<stdio.h>
#include<stdlib.h>
int main()
{
   int a[4][5]={{1,2,3,4,5},{2,4,6,8,10},{3,6,9,12,15},{4,8,12,16,20}};
   int b[4][2]={{-1,-1},{-1,-1},{-1,-1},{-1,-1}};
   for(int i=0;i<4;i++)
     {
           for(int j=0;j<5;j++)
              if(b[i][0]<a[i][j]){b[i][0]=a[i][j];b[i][1]=j;}
     }
   for(int i=0;i<4;i++)
      for(int j=0;j<4;j++)
          if(a[b[i][0]][j]<b[i][0]){b[i][0]=-1;b[i][1]=-1;}
   for(int i=0;i<4;i++)
      if(b[i][0]!=-1&&b[i][1]!=-1)printf("鞍点是%d行%d列，鞍点值是%d\n",i+1,b[i][1]+1,b[i][0]);
   system("pause");
   return 0;
}
